import styles from "@/styles/style";

export default function BlogsHero() {
  return (
    <section className={`w-full min-h-[100vh] bg-brown1 py-6 md:py-8 overflow-hidden`}>
     <div className={`lg:px-48 px-6 lg:py-12 py-6 ${styles.marginX} ${styles.marginY} w-full flex flex-col gap-5`}>
     <h2 className="text-white text-4xl font-bold font-handicrafts">اليوم الوطني</h2>
      <p className={`${styles.paragraph2} text-white w-[90%] max-w-[85%]`}>
        تحتفل المملكة العربية السعودية بيومها الوطني في اليوم الأول من الميزان الموافق 23 سبتمبر (أيلول) من كل عام، وذلك تخليداً لذكرى توحيد المملكة وتأسيسها على يد جلالة الملك عبد العزيز بن عبد الرحمن آل سعود رحمه الله.
        ففي مثل هذا اليوم من عام 1351هـ / 1932م، صدر المرسوم الملكي بإعلان توحيد المملكة العربية السعودية، بعد ملحمة البطولة التي قادها المؤسس الملك عبد العزيز بن عبد الرحمن آل سعود – طيب الله ثراه – على مدى اثنين وثلاثين عاماً، حتى استرداد مدينة الرياض عاصمة ملك أجداده وآبائه، في الخامس من شهر شوال عام 1319هـ الموافق 15 يناير 1902م.
      </p>

      <p className={`${styles.paragraph2} text-white w-[90%] max-w-[85%]`}>
        ومن ثم واصل كفاحه لتوحيد بقية أرجاء الدولة السعودية الحديثة تحت اسم المملكة العربية السعودية، واختار الملك عبدالعزيز يوم الخميس الموافق 21 جمادى الأولى من نفس العام 1351هـ الموافق 23 سبتمبر 1932م، يومًا لإعلان قيام المملكة العربية السعودية.
      </p>

      <p className={`${styles.paragraph2} text-white w-[90%] max-w-[85%]`}>
        • نشأة الملك عبدالعزيز:<br />
        وزارة الخارجية المملكة العربية السعودية || MOFA KSA<br />
        وُلد الملك عبدالعزيز في مدينة الرياض عام 1293هـ / 1876م، ونشأ تحت رعاية والده الإمام عبدالرحمن بن فيصل بن تركي آل سعود، وتعلم القراءة والكتابة على يد الشيخ القاضي عبدالله الخرجي، وهو من علماء الرياض، وحفظ بعضًا من سور القرآن الكريم، ثم قرأه كاملًا على الشيخ محمد بن مصيبيح، كما درس جانبًا من أصول الفقه والتوحيد على يد الشيخ عبدالله بن عبداللطيف آل الشيخ.
      </p>

      <p className={`${styles.paragraph2} text-white w-[90%] max-w-[85%]`}>
        وكان الملك عبدالعزيز في صباه مولعًا بالفروسية وركوب الخيل، وبرزت عليه إمارات القيادة، وملامح الرجولة المبكرة، وميول الصفات الكريمة، وقد رافق والده في رحلته إلى البادية بعد الرحيل من الرياض، وتأثر كثيرًا بالحياة الصحراوية، خاصة فيما يتعلق بالجندية ومصاعب الحياة وخشونة العيش، وعندما حلّ مع أسرته ضيفًا على الكويت في أواخر القرن التاسع عشر، وكان عمره خمس عشرة سنة، وقد بقي في الكويت مع والده حتى بلغ من العمر خمسًا وعشرين سنة، وتعلم السياسة وفنون الحرب، واكتسب كثيرًا من المهارات.
      </p>

      <p className={`${styles.paragraph2} text-white w-[90%] max-w-[85%]`}>
        وزارة الخارجية المملكة العربية السعودية || MOFA KSA<br />
        انطلاقة عهد جديد<br />
        وانطلق الملك المؤسس عبدالعزيز بن عبدالرحمن من الكويت على رأس حملة من أقاربه وأنصاره صوب الرياض، وكان عمره 26 عاماً، وكانت الجزيرة العربية في ذلك الوقت تعاني من الفوضى والتناحر حتى تمكن من دخول الرياض في الخامس من شهر شوال عام 1319هـ الموافق 15 يناير 1902م.
      </p>

      <button className="font-handicrafts max-w-[180px] md:max-w-[200px] lg:max-w-[250px] mt-6 px-6 py-2 border-2 border-beige text-beige rounded-full text-[20px] md:text-[25px] hover:bg-beige hover:text-brown3 transition-colors duration-300">
  المزيد ...
</button>


     </div>
    </section>
  );
}
